{
    "brand_name": "Polo Ralph Lauren",
    "colors": [
        "Collection Navy"
    ],
    "description": "This quilted vest is made with recycled fibers and PrimaLoft® insulation to help keep you warm, dry, and comfortable while reducing environmental impact.",
    "fitting_details": [
        "Size medium has a 28\" front body length, a 28¾\" back body length, a 17¾\" shoulder, and a 44½\" chest.",
        "Mockneck with snapped closures at the front. Suede collar stand. Full-zip front with a leather zipper pull. Buttoned storm placket. Genuine horn buttons.",
        "Ventilating metal grommets and suede patches at the underarms. Two front waist snapped pockets with suede trim. Interior left waist pocket.",
        "Double vent with concealed snapped closures. Fully lined and filled. Leather \"Polo Ralph Lauren\" shield patch with our signature Pony at the left chest.",
        "Shell: Made with recycled polyester, which helps reduce environmental impact by avoiding the use of virgin polyester, a petroleum-based material.",
        "Fill: Made with PrimaLoft®, a recycled polyester fiber which maintains its loft and warmth without the bulk of down.",
        "Visit corporate.RalphLauren.com/citizenship-create-timeless-style for more information on Ralph Lauren's sustainability initiatives.",
        "Lining: 100% nylon. Back yoke and collar: 60% wool, 20% polyester, 20% viscose. Exclusive of trim. Dry clean by a leather specialist. Imported.",
        "Model is 6'1\"/185 cm and wears a size medium."
    ],
    "img_links": [
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415561_alternate10?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415561_lifestyle?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415561_alternate1?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415561_alternate3?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415561_alternate4?$rl_pdp_mob_zoom$"
    ],
    "price": "$398.00",
    "product": "Suede-Trim Quilted Vest",
    "product_id": "588776",
    "sizes": [
        "XS",
        "S",
        "M",
        "L",
        "XL",
        "XXL"
    ],
    "video_links": [
        "https://www.rlmedia.io/is/content/PoloGSI/s7-1415561_rlvideo_vid?video_desktop"
    ]
}