{
    "brand_name": "Polo Ralph Lauren",
    "colors": [
        "Clubhouse Cream"
    ],
    "description": "This reissue of an archival Polo model features 750-fill-power down, faux-fur trim, and a leather logo patch.",
    "fitting_details": [
        "Size medium has a 33½\" body length (front and back), a 21¼\" shoulder, a 50\" chest, and a 36½\" sleeve length. Sleeve length is taken from the center back of the neck and changes 1\" between sizes.",
        "Drawstring hood with faux-fur trim, leather stoppers, and leather tips. Adjustable buckled tab at the back of the hood. Buttoned throat latch. Full-zip front. Buttoned storm placket.",
        "Long sleeves with stitched elbow patches. Buttoned shoulder epaulets. Ribbed storm cuffs. Two chest cargo pockets. Two front waist buttoned pockets. Two interior waist pockets.",
        "Drawcord waist with leather stoppers and tips. Drawcord hem with leather stoppers. Fully lined and filled.",
        "Leather \"Polo Ralph Lauren\" shield patch with our signature Pony at the left sleeve.",
        "750 fill power. Fill power measures the loft of the down and ranges from 450 to 1,000 for apparel.",
        "Shell: 100% recycled polyester. Faux-fur: 44% acrylic, 43% modacrylic, 13% polyester. Trim: 100% cow leather. Cuffs: 68% wool, 30% polyester, 1% elastane, 1% other fibers. Fill: 90% white duck down, 10% white duck feathers.",
        "Machine washable. Imported.",
        "Model is 6'1\"/185 cm and wears a size medium."
    ],
    "img_links": [
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415612_alternate10?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415612_lifestyle?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415612_alternate1?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415612_alternate3?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1415612_alternate4?$rl_pdp_mob_zoom$"
    ],
    "price": "$798.00",
    "product": "Faux-Fur-Trim Down Parka",
    "product_id": "612975",
    "sizes": [
        "XS",
        "S",
        "M",
        "L",
        "XL",
        "XXL"
    ],
    "video_links": [
        "https://www.rlmedia.io/is/content/PoloGSI/s7-1415612_rlvideo_vid?video_desktop"
    ]
}