{
    "brand_name": "RLX",
    "colors": [
        "College Navy"
    ],
    "description": "Engineered for maximum performance in wet climes, this lightweight marsh coat is constructed with a three-layer, water-repellent shell and fully seam-sealed at the interior. It is also made with recycled polyester, reinforcing Ralph Lauren's aim to create the highest-quality products while considering our environment.",
    "fitting_details": [
        "Size medium has a 38\" front body length, a 40.5\" back body length, a 21.5\" shoulder, a 51\" chest, and a 36\" sleeve length. Sleeve length is taken from the center back of the neck and changes 0.75\" between sizes.",
        "Drawstring stowaway hood with a built-in brim, an adjustable drawcord at the back, and reflective trim. Mockneck. Full-zip front. Snapped storm placket.",
        "Long sleeves. Adjustable hook-and-loop cuff tabs. Right sleeve zip-and-flap pocket. Rubber \"RLX\" tab at each elbow. Leather-trimmed \"RLX Ralph Lauren\" plaque at the left sleeve.",
        "Two chest zip-and-snap pockets. Two front waist buttoned pockets.",
        "Drawstring waist with leather stoppers. Fishtail hem. Unlined. Fully seam-sealed at the interior.",
        "This product is made with recycled polyester. By turning industrial and post-consumer polyester waste into new product, we are reducing our dependence on virgin petroleum-based material.",
        "Shell: 100% recycled polyester. Drawcord tunnel: 100% nylon. Trim: 100% cow leather. Machine washable. Imported.",
        "Visit corporate.RalphLauren.com/citizenship-create-timeless-style for more information on Ralph Lauren's sustainability initiatives.",
        "Model is 6'1\" (185 cm) and wears a size medium."
    ],
    "img_links": [
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1450722_alternate10?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1450722_lifestyle?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1450722_alternate1?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1450722_alternate3?$rl_pdp_mob_zoom$",
        "https://www.rlmedia.io/is/image/PoloGSI/s7-1450722_alternate4?$rl_pdp_mob_zoom$"
    ],
    "price": "$798.00",
    "product": "Water-Repellent Hooded Marsh Coat",
    "product_id": "614423",
    "sizes": [
        "XS",
        "S",
        "M",
        "L",
        "XL",
        "XXL"
    ],
    "video_links": [
        "https://www.rlmedia.io/is/content/PoloGSI/s7-1450722_rlvideo_vid?video_desktop"
    ]
}